app/controllers/gastos_controller.rb

SELECT "gastos".* FROM "gastos"
---
  def index
    @gastos = Gasto.all

SELECT "gastos".* FROM "gastos" WHERE "gastos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @gasto = Gasto.find(params[:id])

INSERT INTO "gastos" ("categoria", "created_at", "data", "descricao", "updated_at", "valor") VALUES (?, ?, ?, ?, ?, ?)  [["categoria", 1], ["created_at", Thu, 09 Aug 2012 03:08:32 UTC +00:00], ["data", Fri, 10 Aug 2012], ["descricao", "Starbucks"], ["updated_at", Thu, 09 Aug 2012 03:08:32 UTC +00:00], ["valor", 8.0]]
---
  def create
    @gasto = Gasto.new(params[:gasto])

    respond_to do |format|
      if @gasto.save